Repository: bakberdy/habit_app
Catalog: lib/l10n/intl_*.arb
Languages: kk

# welcome
source: Welcome, {name}
kk: Қош келдіңіз, {name}

source: Home
kk: Басты бет

source: Your activity calendar
kk: Сіздің белсенділік күнтізбеңіз

source: Your today's plan
kk: Бүгінгі жоспарыңыз

source: More plan
kk: Көбірек жоспар

source: Daily motivation
kk: Күнделікті мотивация

# author
source: Author: {author}
kk: Авторы: {author}

source: Recomendations
kk: Ұсыныстар

source: Catalog
kk: Каталог

source: My plan
kk: Менің жоспарым

source: Settings
kk: Баптаулар

source: Browse habits
kk: Әдеттерді шолу

source: Browse
kk: Шолу

source: Category
kk: Санат

source: Habits
kk: Әдеттер

source: No habits found.
kk: Әдеттер табылмады.

source: Search Results
kk: Іздеу нәтижелері

source: Details
kk: Мәліметтер

source: Why:
kk: Неліктен:

source: Takes minutes:
kk: Минутты алады:

source: Days:
kk: Күндер:

source: Tips:
kk: Кеңестер:

source: Habit is already in your plan. Good job!
kk: Бұл әдет сіздің жоспарыңызда бар. Жарайсыз!

source: Add To Plan
kk: Жоспарға қосу

# youDontHaveAnyPlansOnThisDayntapToAdd
source: You don't have any plans on this day. Tap + to add a new habit!
kk: Бұл күні ешқандай жоспарыңыз жоқ. Жаңа әдет қосу үшін + батырмасын басыңыз!

source: Great job! You completed {doneHabits} out of {max} habits {dayText}. 😊
kk: Керемет! Сіз {dayText} күні {max} әдеттің {doneHabits} орындадыңыз. 😊

source: Create your own habit
kk: Өз әдетіңізді жасаңыз

source: Title
kk: Атауы

source: Description
kk: Сипаттама

source: Estimated time(minute)
kk: Шамамен уақыт (минут)

source: Days that you want to do
kk: Істегіңіз келетін күндер

source: Add more details to clarify your habit
kk: Әдетті нақтылау үшін қосымша мәлімет енгізіңіз

source: Tip to habit
kk: Әдетке кеңес

source: Tip description
kk: Кеңес сипаттамасы

source: Create
kk: Жасау

source: {takesTime} minutes
kk: {takesTime} минут алады

source: Add a new routine
kk: Жаңа дағды қосу

source: Browse rountines
kk: Дағдыларды шолу

source: Create Own
kk: Өзіндік жасау

source: Language
kk: Тіл

source: Notifications
kk: Хабарландырулар

source: Help & Support
kk: Көмек және қолдау

source: About app
kk: Қосымша туралы

source: Not Found
kk: Табылмады

source: No
kk: Жоқ

source: Yes
kk: Иә

source: Search
kk: Іздеу

source: Monday
kk: Дүйсенбі

source: Tuesday
kk: Сейсенбі

source: Wednesday
kk: Сәрсенбі

source: Thursday
kk: Бейсенбі

source: Friday
kk: Жұма

source: Saturday
kk: Сенбі

source: Sunday
kk: Жексенбі

source: Your yesterday plan
kk: Кешегі жоспарыңыз

source: Your tomorrow plan
kk: Ертеңгі жоспарыңыз

source: Your plan of {day} {month}
kk: {day} {month} күнінің жоспарыңыз

source: January
kk: Қаңтар

source: February
kk: Ақпан

source: March
kk: Наурыз

source: April
kk: Сәуір

source: May
kk: Мамыр

source: June
kk: Маусым

source: July
kk: Шілде

source: August
kk: Тамыз

source: September
kk: Қыркүйек

source: October
kk: Қазан

source: November
kk: Қараша

source: December
kk: Желтоқсан

# forTheLanguageChangeToTakeEffectCorrectlyPleaseReopen
source: For the language change to take effect correctly, please reopen the app.
kk: Тілді өзгерту дұрыс күшіне енуі үшін, қосымшаны қайта іске қосыңыз.

source: Choose a language
kk: Тілді таңдаңыз

source: Enter your name
kk: Атыңызды енгізіңіз

source: Name cannot be empty
kk: Аты бос болмауы керек

source: Let's start
kk: Бастайық

source: Today's habit is the reflection of your future life.
kk: Бүгінгі әдет — ертеңгі өміріңнің бейнесі.

source: Create a habit
kk: Әдетті бастаңыз

# chooseAHabitFromReadymadeSamplesnorCreateYourOwnPersonal
source: Choose a habit from ready-made samples,\nor create your own personal one to match your goals.
kk: Дайын әдет үлгілерінен таңдаңыз немесе өз мақсатыңызға сай жеке әдет жасаңыз.

source: Track your progress
kk: Прогрессті бақылаңыз

# stayMotivatedWithAHeatmapCalendarnandPlanYourDayWith
source: Stay motivated with a heatmap calendar\nand plan your day with clarity.
kk: Жылу картасы арқылы мотивацияны сақтаңыз және күніңізді нақты жоспарлаңыз.

source: Start
kk: Бастау

# whatIsDet
source: What is Ádet?
kk: Ádet деген не?

# detIsASmartAndElegantHabitTrackerThatHelps
source: Ádet is a smart and elegant habit tracker that helps you take small steps toward big life transformations. Whether you want to build a daily meditation routine, drink more water, or master new skills — Ádet will be your supportive companion along the way.
kk: Ádet — үлкен өмірлік өзгерістерге жетелейтін кішкентай қадамдарды жасауға көмектесетін ақылды әрі көркем әдет-трекер. Күнделікті медитация жасау, көбірек су ішу немесе жаңа дағдыларды меңгеру — қандай мақсат қойсаңыз да, Ádet әрдайым сіздің жанында болады.

source: Key Features
kk: Негізгі мүмкіндіктері

source: Ready-made and Custom Habits
kk: Дайын және жеке әдеттер

# chooseFromCarefullyCraftedHabitTemplatesOrCreateYourOwn
source: Choose from carefully crafted habit templates or create your own personalized routines.
kk: Мұқият дайындалған әдет шаблондарының ішінен таңдаңыз немесе өзіңізге ыңғайлы әдеттерді жасаңыз.

source: Heatmap Progress Tracker
kk: Қызу карта арқылы прогресті бақылау

source: Visualize your daily consistency with an interactive heatmap calendar.
kk: Күнделікті тұрақтылығыңызды интерактивті қызу карта-күнтізбе арқылы бақылаңыз.

source: Streak & Motivation System
kk: Тізбекті және мотивациялық жүйе

# stayEngagedAndInspiredByTrackingYourStreaksAndSetting
source: Stay engaged and inspired by tracking your streaks and setting gentle reminders.
kk: Тізбектерді қадағалап, еске салғыштарды орнату арқылы мотивацияңызды жоғалтпаңыз.

source: Multilingual Support
kk: Көптілді қолдау

# availableInKazakhRussianAndEnglishBecauseGrowthHasNo
source: Available in Kazakh, Russian, and English — because growth has no language barrier.
kk: Қазақ, орыс және ағылшын тілдерінде қолжетімді — өйткені даму тілге тәуелді емес.

# builtForDreamersDoersAndDisciplinedMindsnstartYourDetJourney
source: Built for dreamers, doers, and disciplined minds. Start your Ádet journey today.
kk: Армандаушыларға, әрекет етушілерге және тәртіпті жандарға арналған. Ádet жолыңызды бүгін бастаңыз.

# supportRequestFromDet
source: Support request from Ádet
kk: Ádet қолданушысынан қолдау сұранысы

# helloDetTeamnniNeedHelpWith
source: Hello Ádet team,\n\nI need help with...
kk: Сәлем, Ádet командасы! Маған келесі мәселеде көмек қажет...

source: Could not launch email client.
kk: Электрондық пошта клиенті ашылмады.

source: Support
kk: Қолдау

source: Need help or have feedback?
kk: Көмек керек пе немесе пікір қалдырғыңыз келе ме?

# wereHereToHelpYouStayOnTrackWithYour
source: We’re here to help you stay on track with your habits.
kk: Біз сізге әдеттеріңізді сақтау жолында көмектесуге дайынбыз.

source: 📧 Contact us:
kk: 📧 Бізге хабарласыңыз:

source: ❓ Frequently Asked Questions
kk: ❓ Жиі қойылатын сұрақтар

source: How do I create a habit?
kk: Қалай әдет қосамын?

# goToTheMyPlansPageAndTapToAdd
source: Go to the my plans page and tap "+" to add a habit.
kk: "Менің жоспарларым" бетіне өтіп, «+» белгісін басыңыз.

source: Yes! You can add as many habits as you want.
kk: Иә! Қалағаныңызша көп әдет қоса аласыз.

source: Yes, you can enable notifications in settings.
kk: Иә, еске салғыштарды баптаулардан қосуға болады.

source: Send Feedback
kk: Пікір жіберу

source: Can I track multiple habits?
kk: Бірнеше әдетті қадағалай аламын ба?

# doesDetSendReminders
source: Does Ádet send reminders?
kk: Ádet еске салғыштар жібере ме?
